void box_1() {
  ////==================================================
}

void box_2() {
  
}

void box_3() {
  
}

void box_4() {

}

void box_5() {
}

void box_6() {
}

void towhite()// จุดมาร์คไปยังสีขาว
{
 
}

void toblack()// จุดมาร์คไปยังสีดำ
  {
 
  }

// ทุก to* เริ่มจากและต้องกลับมาจบที่จุดกลางสนาม
// เขียนเส้นทาง: จุดกลาง -> หยิบของสีนี้ -> จุดวาง -> กลางสนาม ไว้ในแต่ละฟังก์ชัน
void toyellow()// ภารกิจของสีเหลือง
  {
  

  }

void tored()// ภารกิจของสีแดง
  {
 

  }

void toblue() // ภารกิจของสีน้ำเงิน
  {

  }

void togreen() // ภารกิจของสีเขียว
  {


  }

void finish() 
{

  
}
