//  void point_3_ring()
//   {
     
//       gyro_reset();
//       rotateFW_pivot(40, 50.0f, 20); 
//       rotateFW_pivot(40, 5.0f, 20); 
//        f_line(40, 40, 0.0f, f8,    0);
//        turn(tfr, 60, f6,  8); 
//        positoin_error = 80;  
//       f_line(70,70, 1.1f, gyro_angle(-135.0f), 20);
//       delay(100);
//       //if (!f_line_gyro_succeeded()) { motor(1, 1); return; }
//       rotateFW_pivot(40, -250.0f, 20);  
//       arm_minOpenUp();
//       fw_gyro(-250.0f, 30, 1.2f, 10.0f, 1);
//       delay(100); 
//       bw_gyro(-250.0f, 50, 1.2f, 10.0f, 1);    //  ถอยหลังออกมาจากวงกลมเล็ก

//       b_line(20, 20, 0.0f, cl,    2);
//       turn(tl, 60, f3,  20);
//       arm_closeDown();
//       positoin_error = 20;  
//       f_line(60, 60, 1.25f, gyro_angle(200.0f), 20);
//       //if (!f_line_gyro_succeeded()) { motor(1, 1); return; }

//       fw_gyro(180.0f, 60, 1.2f, 15.0f, 0);    ///----------------->>ระยะวิ่งออกจากวงกลม
      
//       f_line(40, 40, 0.0f, f15, 1);
//       turn(tcl, 50, b7,  5); 
//       //f_line(30, 30, 0.5f, f15, 10);
//       b_line(20, 20, 0.025f, cr, 20);
//       turn(tr, 50, f9,  15); 
    
//   }

// void Zone_3_yollow()
//   {
//       f_line(15, 15, 0.5f, f0,    1);
//       gyro_reset();
//       rotateFW_pivot(40, 90.0f, 20); 
//       rotateFW_pivot(40, 0.0f, 20); 
//       fw_gyro(0.0f,   70, 1.2f, 60.0f, 1);
//       delay(200);
//       servoL(servo_L-90);
//       servoR(servo_R-90);
//       delay(300);
//       servoUpDown(servo_down+90);
//       delay(100);

//       bw_gyro(0.0f,   70, 1.2f, 50.0f, 1);
//       turn(tcl, 40, f6,  5);
//       f_line(30, 30, 1.75f, cl,    2);
//       turn(tl, 60, f6,  15);
       
//   }
  
// void Zone_3_toBox_L()
//   {
//       f_line(15, 15, 0.5f, f0,    1);
//       gyro_reset();
//       rotateFW_pivot(40, 90.0f, 20); 
//       rotateFW_pivot(40, 0.0f, 20); 
//       fw_gyro(0.0f,   70, 1.2f, 60.0f, 1);
//       delay(200);
//       servoL(servo_L-90);
//       servoR(servo_R-90);
//       delay(300);
//       servoUpDown(servo_down+90);
//       delay(100);

//       bw_gyro(0.0f,   70, 1.2f, 50.0f, 1);
//       f_line(20, 20, 0.0f, cl,    2);
//       rotate_spin(50, -90.0f, 20);
//       servoUpDown(servo_down);

//       fw_gyro(-90.0f, 15, 1.2f, 23.0f, 1);
//       delay(100);
//       arm_closeDown();
//       rotate_spin(30, 180.0f, 20);

//       f_line(30, 30, 0.0f, f0,    5);
//       turn(tcr, 50, b6,  5);
//       b_line(20, 20, 0.75f, cl,    2);
//       turn(tl, 40, f6,  5);     
//   }

// void Z_FW()
//   {
//        arm_openDown();
//        f_line(80, 80, 1.752f, 35, 0);
//        f_line(20, 20, 0.752f, f15, 20);
//        turn(tfr, 40, f15,  15);
//        delay(100);
//        arm_closeDown(); 
//        f_line(20, 20, 1.752f, f3, 10);
//        turn(tfl, 90, f7,  15);
//        f_line(80, 80, 1.752f, 25, 0);
//        f_line(20, 20, 0.752f, f15, 20);
//   }

// void Z_BW()
//   {
//       arm_openDown();
//       f_line(80, 80, 1.752f, 35, 0);
//        f_line(20, 20, 1.55f, f13, 20);
//        turn(tfr, 40, f15,  15);
//        arm_closeDown(); 
//        b_line(20, 20, 1.752f, cr, 10);
//        turn(tr, 60, f15,  10);
//        f_line(50, 50, 1.752f, 35, 20);
//   }
 
 //-------------------------------------------------------
  // for (int i = 0; i < 4; i++) {// เหลือง
  //   arm_kib();
  // f_line(20, 20, 0.3f, f0 & 15, 20);
  // delay(100);
  // exitBlackLineStraight(8);
  // // delay(200);
  // gyro_reset();
  // // delay(200);
  // fgyro(-90.0f, 50, 0.7f, 22.0f, 0);
  // fgyro(0.0f, 50, 0.7f, 35.0f, 0);
  // fgyro(70.0f, 50, 0.7f, 23.0f, 10);
  // gyro_turn(-1, 50, 20.0f, 1.1f, 0.05f, 20);
  // up_a();
  // gyro_turn(1, -50, 70.0f, 1.1f, 0.05f, 20);
  // bgyro(70.0f, 50, 0.7f, 20.0f, 0);
  // bgyro(0.0f, 50, 0.7f, 34.0f, 0);
  // bgyro(-90.0f, 50, 0.7f, 20.0f, 10);
  // b_line(30, 30, 0.5f, 5, 0);
  // turn(tcl, 60, f5, 10);
  // wait_button();
  //   f_line(30, 30, 0.5f, 15, 10);
  // turn(tr, 60, f10, 10);
  // } // เหลือง


  //  วงกลม
  // f_line(20, 20, 0.3f, f0 & 15, 20);
  // delay(100);
  // exitBlackLineStraight(8);
  // gyro_reset();
  // gyro_turn(50, -1, 90.0f, 0.85f, 0.05f, 20);
  // fgyro(90.0f, 50, 0.95f, 13.0f, 10);
  // gyro_turn(-50, 50, 0.0f, 0.85f, 0.05f, 20);
  // down_a();
  // fgyro(0.0f, 40, 0.95f, 25.0f, 10);
  // bgyro(0.0f, 40, 0.95f, 28.0f, 10);
  // gyro_turn(50, -50, 90.0f, 0.85f, 0.05f, 20);
  // bgyro(90.0f, 50, 0.95f, 22.0f, 10);
  // gyro_turn(50, -50, 180.0f, 0.85f, 0.05f, 20);
  //  วงกลม





  // f_line(20, 20, 0.3f, f0 & 15, 20);
  // delay(100);
  // exitBlackLineStraight(8);
  // gyro_reset();
  // gyro_turn(50, -1, 90.0f, 0.75f, 0.03f, 20);
  // fgyro(90.0f, 60, 0.95f, 35.0f, 10);
  // gyro_turn(-1, 50, 0.0f, 0.75f, 0.03f, 20);
  // // wait_button();
  // f_line(40, 45, 0.0f, f10, 0);
  // f_line(40, 40, 0.0f, 5, 10);
  // turn(tr, 60, f7, 10);
  // positoin_error = 90;  // ให้เส้นอยู่ค่อนไปทางเซนเซอร์ขวาในคำสั่งถัดไป
  // f_line(50, 50, 0.72f, gyro_angle(-75.0f), 20);
  // delay(100);
  // gyro_turn(-1, 50, -180.0f, 0.75f, 0.03f, 20);
  // arm_readyy();
  // fgyro(-180.0f, 30, 0.95f, 20.0f, 10);
  // bgyro(-180.0f, 30, 0.95f, 10.0f, 0);
  // b_line(40, 40, 0.0f, b15, 10);
  // turn(tcl, 40, f4, 10);
  // arm_kib();
  // f_line(50, 50, 0.72f, gyro_angle(190.0f), 20);
  // delay(100);
  // fgyro(-180.0f, 40, 1.0f, 30.0f, 10);
  /////////////////////////////////////////////////////////////
  // fgyro(0.0f, 60, 1.2f, 30.0f, 10);
  // bgyro(0.0f, 60, 1.2f, 30.0f, 10);
  // wait_button();
  // f_line(20, 20, 0.3f, f0 & 15, 20);
  // delay(100);
  // exitBlackLineStraight(8);
  // gyro_reset();
  // gyro_turn(60, -1, 90.0f, 0.72f, 0.05f, 10);
  // fgyro(90.0f, 60, 1.2f, 38.0f, 10);
  // gyro_turn(-1, 60, 0.0f, 0.72f, 0.05f, 10);
  // fgyro(0.0f, 60, 1.2f, 53.0f, 10);
  // gyro_turn(-40, 40, -90.0f, 0.50f, 0.02f, 10);
  // fgyro(-90.0f, 40, 0.95f, 23.0f, 10);
  // gyro_turn(-1, 60, -137.0f, 0.80f, 0.05f, 10);
  // arm_readyy();
  // fgyro(-137.0f, 20, 0.95f, 5.0f, 10);
  // bgyro(-137.0f, 20, 0.95f, 5.0f, 10);
  // arm_up_close();delay(200);
  // gyro_turn(1, -60, -90.0f, 0.72f, 0.05f, 10);
  // bgyro(-90.0f, 40, 1.2f, 25.0f, 10);
  // gyro_turn(40, -40, 0.0f, 0.50f, 0.02f, 10);
  // bgyro(0.0f, 60, 1.2f, 53.0f, 10);
  // gyro_turn(1, -60, 90.0f, 0.72f, 0.05f, 10);
  // bgyro(90.0f, 60, 1.2f, 42.0f, 10);
  // gyro_turn(40, -40, 180.0f, 0.50f, 0.02f, 10);


  // wait_button();


  // gyro_turn(-1, 50, -180.0f, 0.75f, 0.05f, 20);
  // arm_readyy();
  // fgyro(-180.0f, 30, 0.95f, 20.0f, 10);
  // bgyro(-180.0f, 30, 0.95f, 10.0f, 0);
  // b_line(40, 40, 0.0f, b15, 10);
  // turn(tcl, 40, f4, 10);
  // arm_kib();
  // f_line(50, 50, 0.72f, gyro_angle(190.0f), 20);
  // delay(100);
  // fgyro(-180.0f, 40, 1.0f, 30.0f, 10);









  // down_a();
  // fgyro(0.0f, 40, 0.95f, 25.0f, 10);
  // bgyro(0.0f, 40, 0.95f, 28.0f, 10);
  // gyro_turn(50, -50, 90.0f, 0.85f, 0.05f, 20);
  // bgyro(90.0f, 50, 0.95f, 22.0f, 10);
  // gyro_turn(50, -50, 180.0f, 0.85f, 0.05f, 20);

  ///////////////////////////////////////////////////////////////////



  //  f_line(20, 20, 0.3f, f0 & 15, 20);
  //   delay(100);
  //   exitBlackLineStraight(8);
  //   // delay(200);
  //   gyro_reset();
  //   // delay(200);
  //   // fw_gyro(70.0f, 40, 1.2f, 10.0f, 0);
  //   delay(100);

  //   fw_gyro(-10.0f, 50, 1.2f, 10.0f, 0);
  //   f_line(55, 50, 0.0f, cr, 10);
  //   // wait_button();
  //   // f_line(50, 50, 0.0f, 3, 10);
  //   turn(tl, 40, f10, 10);
  //   positoin_error = 10;
  // f_line(60, 60, 0.72f, gyro_angle(120.0f), 10);
  // delay(100);
  //   // rotateFW_pivot(50, 235.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  //   arm_closeUp();
  //   fw_gyro(235.0f, 20, 1.0f, 10.0f, 10);
  //   // bw_gyro(-255.0f, 40, 1.0f, 5.0f, 0);
  //   b_line(40, 40, 0.0f, b15, 0);
  //   turn(tcr, 60, f11, 5);
  //   arm_kib();
  //   positoin_error = 90;
  //   f_line(60, 60, 0.72f, gyro_angle(165.0f), 0);
  //   ////////----------------------------------------
  //   fw_gyro(-180.0f, 40, 1.2f, 15.0f, 10);

  //   wait_button();
  //   f_line(40, 40, 0.0f, f0, 0);
  //   f_line(40, 40, 0.0f, 7, 20);
  // do { motor(-1, 50); } while (readADC_F(15) > 520);  // F0 ยังเป็นพื้นขาว ให้เดินต่อ
  // motor(-1, -1);                                     // เบรกเมื่อ F0 เจอเส้นดำ
  // delay(10);
  // do { motor(50, -1); } while (readADC_F(8) > 520);  // F0 ยังเป็นพื้นขาว ให้เดินต่อ
  // motor(-1, -1);                                     // เบรกเมื่อ F0 เจอเส้นดำ
  // delay(10);
  // positoin_error = 50;




  ///////////////////////////////////////////////////////////////////
  // wait_button();
  // F_FLINE(60, 60, 2.0f, f15, 0, 'L');
  // F_FLINE(60, 60, 2.0f, 50, 0, 'L');
  // F_FLINE(60, 60, 2.0f, f15, 20, 'R');
  // f_line(30, 30, 2.0f, 40, 20);
  // wait_button();
  // F_FLINE(60, 60, 2.0f, 100, 20);


  // f_line(60, 60, 0.75f, f15, 10);
  // turn(tfr, 100, f10, 5);
  // f_line(60, 60, 0.75f, f0, 10);
  // turn(tfl, 100, f5, 5);
  // F_line(60, 60, 1.4f, 40, 40);


  // wait_button();
  /////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  // F_line(50, 50, 1.2f, 100, 20, 'R');
  // f_line(20, 20, 0.3f, f0 & 15, 20);
  // delay(100);
  // exitBlackLineStraight(8);
  // // delay(200);
  // gyro_reset();
  // // delay(200);
  // rotateFW_pivot(50, -70.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // rotateFW_pivot(50, 0.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // fw_gyro(0.0f, 50, 1.0f, 20.0f, 10);
  // turn(tl, 60, f9, 5);
  // positoin_error = 10;
  // f_line(60, 60, 0.72f, gyro_angle(120.0f), 20);
  // delay(100);
  // rotateFW_pivot(50, 235.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // arm_closeUp();
  // f_line(15, 15, 0.0f, f15, 0);
  // f_line(15, 15, 0.0f, 2, 10);
  // fw_gyro(235.0f, 20, 1.0f, 10.0f, 0);
  // // bw_gyro(-255.0f, 40, 1.0f, 5.0f, 0);
  // b_line(40, 40, 0.0f, b15, 0);
  // turn(tcr, 60, f11, 5);
  // // arm_kib();
  // positoin_error = 90;
  // f_line(60, 60, 0.72f, gyro_angle(170.0f), 20);
  // delay(100);
  // ////////----------------------------------------
  // fw_gyro(-180.0f, 50, 1.2f, 20.0f, 0);

  // // wait_button();
  // f_line(40, 40, 0.0f, f15, 0);
  // f_line(40, 40, 0.0f, 6, 20);
  // do { motor(-1, 50); } while (readADC_F(15) > 520);// F0 ยังเป็นพื้นขาว ให้เดินต่อ
  // motor(-1, -1);// เบรกเมื่อ F0 เจอเส้นดำ
  // delay(10);
  // do { motor(50, -1); } while (readADC_F(6) > 520);// F0 ยังเป็นพื้นขาว ให้เดินต่อ
  // motor(-1, -1);// เบรกเมื่อ F0 เจอเส้นดำ
  // delay(10);
  // positoin_error = 50;

  // f_line(20, 20, 0.3f, f0 & 15, 20);
  // delay(100);
  // exitBlackLineStraight(8);
  // delay(100);
  // gyro_reset();
  // delay(100);
  // rotateFW_pivot(60, 90.0f, 10);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // fw_gyro(90.0f, 40, 1.0f, 17.0f, 10);
  // rotateFW_pivot(60, -15.0f, 10);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // down_a();
  // fw_gyro(-15.0f, 20, 1.0f, 25.0f, 10);
  // bw_gyro(-15.0f, 20, 1.0f, 25.0f, 10);
  // arm_up_close();
  // rotateBW_pivot(60, 90.0f, 10);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // bw_gyro(90.0f, 40, 1.2f, 20.0f, 10);





  // wait_button();

  // f_line(20, 20, 0.3f, f0 & 15, 20);
  // delay(100);
  // exitBlackLineStraight(8);
  // delay(100);
  // gyro_reset();
  // delay(100);
  // rotateFW_pivot(60, 90.0f, 10);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // fw_gyro(90.0f, 50, 1.2f, 20.0f, 10);
  // rotateFW_pivot(60, 0.0f, 10);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // fw_gyro(0.0f, 50, 1.2f, 35.0f, 10);
  // fw_gyro(-80.0f, 50, 1.2f, 40.0f, 10);
  // delay(100);
  // rotateFW_pivot(60, 0.0f, 10);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // delay(100);
  // up_a();
  // rotateBW_pivot(60, -80.0f, 10);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // delay(100);
  // bw_gyro(-80.0f, 50, 1.2f, 22.0f, 10);
  // rotateBW_pivot(60, 0.0f, 10);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // bw_gyro(0.0f, 50, 1.2f, 37.0f, 10);
  // rotateBW_pivot(60, 90.0f, 10);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // bw_gyro(90.0f, 40, 1.2f, 20.0f, 10);


  // wait_button();
  // arm_kib();
  // f_line(20, 20, 0.3f, f0 & 15, 20);
  // delay(100);
  // exitBlackLineStraight(8);
  // delay(100);
  // gyro_reset();
  // delay(100);
  // // rotateFW_pivot(60, 90.0f, 10);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // fw_gyro(90.0f, 50, 1.2f, 25.0f, 0);
  // // rotateFW_pivot(60, 0.0f, 10);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // fw_gyro(0.0f, 50, 1.2f, 40.0f, 0);
  // fw_gyro(-80.0f, 50, 1.2f, 40.0f, 10);
  // delay(100);
  // rotateFW_pivot(60, 0.0f, 10);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // delay(100);
  // up_a();
  // rotateBW_pivot(60, -80.0f, 10);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // delay(100);
  // bw_gyro(-80.0f, 50, 1.2f, 30.0f, 0);
  // // rotateBW_pivot(60, 0.0f, 10);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // bw_gyro(0.0f, 50, 1.2f, 37.0f, 0);
  // // rotateBW_pivot(60, 90.0f, 10);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // bw_gyro(90.0f, 40, 1.2f, 20.0f, 10);

  /////////////////////////////////////////////////////////////////////////////////////////////////////////////////




  // f_line(20, 20, 0.3f, f0 & 15, 20);
  // delay(100);
  // exitBlackLineStraight(8);
  // // delay(200);
  // gyro_reset();
  // delay(100);
  // // fw_gyro(70.0f, 40, 1.2f, 10.0f, 0);
  // rotateFW_pivot(40, -10.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // delay(100);

  // fw_gyro(-10.0f, 50, 1.2f, 10.0f, 0);
  // f_line(60, 50, 0.0f, cr, 10);
  // // wait_button();
  // // f_line(50, 50, 0.0f, 3, 10);
  // turn(tl, 40, f10, 10);
  // positoin_error = 10;
  // f_line(60, 60, 0.72f, gyro_angle(115.0f), 10);
  // delay(100);
  // rotateFW_pivot(50, 235.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // arm_closeUp();
  // fw_gyro(232.0f, 20, 1.0f, 11.0f, 10);
  // // bw_gyro(-255.0f, 40, 1.0f, 5.0f, 0);
  // b_line(40, 40, 0.0f, b15, 0);
  // turn(tcr, 60, f11, 5);
  // arm_kib();
  // positoin_error = 90;
  // f_line(60, 60, 0.72f, gyro_angle(170.0f), 20);
  // delay(150);
  // ////////----------------------------------------
  // fw_gyro(-180.0f, 40, 1.2f, 22.0f, 10);

  // wait_button();
  // f_line(40, 40, 0.0f, f0, 0);
  // f_line(40, 40, 0.0f, 7, 20);
  // do { motor(-1, 50); } while (readADC_F(15) > 520);  // F0 ยังเป็นพื้นขาว ให้เดินต่อ
  // motor(-1, -1);                                      // เบรกเมื่อ F0 เจอเส้นดำ
  // delay(10);
  // do { motor(50, -1); } while (readADC_F(6) > 520);  // F0 ยังเป็นพื้นขาว ให้เดินต่อ
  // motor(-1, -1);                                     // เบรกเมื่อ F0 เจอเส้นดำ
  // delay(10);
  // positoin_error = 50;
  // wait_button();




  // wait_button();
  ///////////////////////////////----------------------------//yellow
  // f_line(20, 20, 0.45f, f0 & 15, 22);
  // exitBlackLineStraight(8);
  // gyro_reset();
  // delay(100);
  // fgyro(45.0f, 80, 0.67f, 11.0f, 0);
  // fgyro(0.0f, 80, 0.69f, 57.0f, 10);
  // arm_u_lr();
  // delay(150);
  // bgyro(0.0f, 80, 0.67f, 42.0f, 10);
  // turn(tl, 60, f5, 10);
  // arm_readyy();
  // f_line(40, 40, 0.5f, 15, 0);
  // f_line(15, 15, 0.5f, 5, 10);
  // arm_kib();
  // delay(200);
  // b_line(40, 40, 0.5f, 25, 20);
  // delay(200);
  // rotateFW_pivot(40, -180.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // fgyro(-180.0f, 40, 1.0f, 5.0f, 0);

  // f_line(40, 40, 0.0f, f0, 0);
  // f_line(40, 40, 0.0f, 5, 20);
  // do { motor(50, -1); } while (readADC_F(0) > 520);  // F0 ยังเป็นพื้นขาว ให้เดินต่อ
  // motor(-1, -1);                                     // เบรกเมื่อ F0 เจอเส้นดำ
  // delay(10);
  // do { motor(-1, 50); } while (readADC_F(8) > 520);  // F0 ยังเป็นพื้นขาว ให้เดินต่อ
  // motor(-1, -1);                                     // เบรกเมื่อ F0 เจอเส้นดำ
  // delay(10);
  // f_line(40, 40, 0.5f, 10, 20);
  // turn(tcr, 60, f10, 10);
  // wait_button();


  // f_line(20, 20, 0.45f, f0 & 15, 22);
  // exitBlackLineStraight(8);
  // gyro_reset();
  // delay(100);
  // fgyro(45.0f, 80, 0.67f, 11.0f, 0);
  // fgyro(0.0f, 80, 0.69f, 57.0f, 10);
  // arm_u_lr();
  // delay(150);
  // delay(150);
  // bgyro(0.0f, 80, 0.67f, 50.0f, 0);
  // b_line(40, 40, 0.0f, 3, 0);
  // turn(tcl, 60, f5, 10);


  // fgyro(-62.0f, 70, 0.67f, 25.0f, 0);

  ///////////////////////////////----------------------------//
  //  for(int i = 0; i < 3; i++)
  //  {
  //   arm_kib();
  // f_line(50, 50, 0.5f, f0, 20);
  // turn(tcl, 60, f5,10);
  // f_line(20, 20, 0.45f, f0 & 15, 22);
  // delay(100);
  // exitBlackLineStraight(8);
  // delay(100);
  // gyro_reset();
  // delay(100);
  // fgyro(45.0f, 80, 0.67f, 15.0f, 0);
  // fgyro(0.0f, 80, 0.67f, 34.0f, 0);
  // fgyro(-62.0f, 70, 0.67f, 25.0f, 0);
  // rotateFW_pivot(40, 0.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // arm_closeUp();
  // delay(150);
  // rotateBW_pivot(40, -62.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // bgyro(-62.0f, 70, 0.62f, 18.0f, 10);
  // rotateBW_pivot(40, 0.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // bgyro(0.0f, 80, 0.67f, 30.0f, 0);
  // bgyro(45.0f, 80, 0.67f, 20.0f, 0);
  // bgyro(0.0f, 50, 0.67f, 7.0f, 0);
  // b_line(40, 40, 0.5f, 1, 0);
  // turn(tcl, 60, f5, 10);
  //   f_line(70, 70, 0.65f, 15, 0);
  //   turn(tl, 60, f5, 10);
  //  }
  ///////////////////////////////////////////---------------------------------//
  // wait_button();

  // fgyro(0.0f, 80, 0.75f, 20.0f, 0);
  // fgyro(-90.0f, 80, 0.75f, 55.0f, 0);
  // fgyro(0.0f, 80, 0.75f, 20.0f, 0);
  // fgyro(55.0f, 80, 0.75f, 30.0f, 0);
  // fgyro(0.0f, 80, 0.75f, 20.0f, 0);
  // bgyro(0.0f, 80, 0.69f, 15.0f, 0);
  // bgyro(70.0f, 80, 0.69f, 25.0f, 0);
  // bgyro(0.0f, 80, 0.69f, 15.0f, 0);
  // bgyro(-60.0f, 80, 0.69f, 35.0f, 0);
  // bgyro(0.0f, 80, 0.69f, 25.0f, 0);
  // fgyro(0.0f, 80, 0.75f, 20.0f, 0);
  // fgyro(55.0f, 80, 0.75f, 70.0f, 0);
  // fgyro(0.0f, 80, 0.75f, 25.0f, 0);
  // bgyro(0.0f, 80, 0.65f, 20.0f, 0);
  // bgyro(90.0f, 80, 0.65f, 25.0f, 0);
  // bgyro(0.0f, 80, 0.65f, 20.0f, 0);
  // bgyro(0.0f, 80, 0.65f, 25.0f, 0);
  // bgyro(-60.0f, 80, 0.65f, 30.0f, 0);
  // bgyro(0.0f, 80, 0.65f, 20.0f, 20);
  // f_line(50, 50, 0.5f, f0, 30);
  // f_line(50, 50, 1.5f, 80, 30);

  // wait_button();
  ///////////////////////////////////////////---------------------------------//
  // for (int i = 0; i < 10; i++) {
  //   f_line(20, 20, 0.3f, f0 & 15, 20);
  //   delay(100);
  //   exitBlackLineStraight(8);
  //   delay(200);
  //   gyro_reset();
  //   delay(200);
  //   // fw_gyro(70.0f, 40, 1.2f, 10.0f, 0);
  //   rotateFW_pivot(40, 70.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  //   delay(100);
  //   rotateFW_pivot(40, 0.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  //   delay(100);
  //   fw_gyro(0.0f, 80, 1.2f, 20.0f, 0);
  //   f_line(50, 50, 0.0f, f10, 0);
  //   f_line(50, 50, 0.0f, 3, 10);
  //   turn(tr, 60, f9, 10);
  //   positoin_error = 90;
  //   f_line(60, 60, 0.72f, gyro_angle(-137.0f), 0);
  //   // delay(250);
  //   rotateFW_pivot(50, -256.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  //   arm_closeUp();
  //   fw_gyro(-256.0f, 20, 1.1f, 10.0f, 10);
  //   // bw_gyro(-255.0f, 40, 1.0f, 5.0f, 0);
  //   b_line(40, 40, 0.0f, b15, 0);
  //   turn(tcl, 60, f4, 5);
  //   arm_kib();
  //   positoin_error = 10;
  //   f_line(60, 60, 0.72f, gyro_angle(-160.0f), 0);
  //   // delay(250);
  //   // rotateFW_pivot(40, -180.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  //   fw_gyro(-180.0f, 70, 1.2f, 24.0f, 0);
  //   f_line(40, 40, 0.0f, f0, 0);
  //   f_line(40, 40, 0.0f, 7, 20);
  // do { motor(50, -1); } while (readADC_F(0) > 520);  // F0 ยังเป็นพื้นขาว ให้เดินต่อ
  // motor(-1, -1);                                     // เบรกเมื่อ F0 เจอเส้นดำ
  // delay(10);
  // do { motor(-1, 50); } while (readADC_F(8) > 520);  // F0 ยังเป็นพื้นขาว ให้เดินต่อ
  // motor(-1, -1);                                     // เบรกเมื่อ F0 เจอเส้นดำ
  // delay(10);
  // positoin_error = 50;
  // // turn(tcr, 60, f10, 10);
  //   arm_kib();

  //   f_line(40, 40, 0.7f, 20, 0);
  //   turn(tr, 60, f10, 10);

  // }
  // for (int i = 0; i < 10; i++) {
  //   f_line(20, 20, 0.3f, f0 & 15, 20);
  //   // delay(100);
  //   exitBlackLineStraight(8);
  //   // delay(100);
  //   gyro_reset();
  //   delay(100);
  //   // fw_gyro(70.0f, 40, 1.2f, 10.0f, 0);
  //   rotateFW_pivot(40, 10.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  //   delay(100);
  //   // rotateFW_pivot(40, 0.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  //   // delay(100);
  //   set_line_ramp_start_speed(50);       // สปีดเริ่ม f_line/b_line เมื่อสปีดที่สั่งตั้งแต่ 40
  //   fw_gyro(10.0f, 80, 1.2f, 25.0f, 0);
  //   set_line_ramp_start_speed(50);       // สปีดเริ่ม f_line/b_line เมื่อสปีดที่สั่งตั้งแต่ 40
  //   f_line(50, 60, 0.0f, cl, 10);
  //   set_line_ramp_start_speed(5);       // สปีดเริ่ม f_line/b_line เมื่อสปีดที่สั่งตั้งแต่ 40
  //   // wait_button();
  //   // f_line(50, 50, 0.0f, 3, 10);
  //   turn(tr, 30, f5, 10);
  //   positoin_error = 90;
  //   f_line(70, 70, 0.72f, gyro_angle(-137.0f), 0);
  //   // delay(200);
  // rotateFW_pivot(55, -260.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  //   arm_closeUp();
  //   fw_gyro(-256.0f, 20, 1.2f, 10.0f, 10);
  //   // bw_gyro(-255.0f, 40, 1.0f, 5.0f, 0);
  //   b_line(40, 40, 0.0f, b15, 0);
  //   turn(tcl, 50, f4, 5);
  //   arm_kib();
  //   positoin_error = 10;
  //   f_line(70, 70, 0.72f, gyro_angle(-160.0f), 0);
  //   // delay(200);
  //   // rotateFW_pivot(40, -180.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  //   fw_gyro(-180.0f, 65, 1.2f, 24.0f, 0);
  //   f_line(40, 40, 0.0f, f0, 0);
  //   f_line(40, 40, 0.0f, 6, 20);
  // do { motor(50, -1); } while (readADC_F(0) > 520);  // F0 ยังเป็นพื้นขาว ให้เดินต่อ
  // motor(-1, -1);                                     // เบรกเมื่อ F0 เจอเส้นดำ
  // delay(10);
  // do { motor(-1, 50); } while (readADC_F(8) > 520);  // F0 ยังเป็นพื้นขาว ให้เดินต่อ
  // motor(-1, -1);                                     // เบรกเมื่อ F0 เจอเส้นดำ
  // delay(10);
  //   positoin_error = 50;
  //   // turn(tcr, 60, f10, 10);
  //   arm_kib();

  //   f_line(40, 40, 0.7f, 20, 0);
  // turn(tr, 60, f10, 10);

  // }

  ///////////////////////////////////////////---------------------------------//
  // f_line(50, 50, 0.5f, f0, 10);
  // arm_u_lr();
  // turn(tfl, 90, f5, 10);
  // f_line(30, 30, 1.2f, 30, 0);
  // // delay(100);
  // f_line(10, 10, 1.2f, 9, 10);
  // arm_u_kib();
  // delay(200);
  // // turn(tfl, 90, f5, 10);
  // do { motor(40, -40); } while (readADC_F(15) > 520);  // F0 ยังเป็นพื้นขาว ให้เดินต่อ
  // motor(-1, -1);                                     // เบรกเมื่อ F0 เจอเส้นดำ
  // delay(10);
  // do { motor(40, -40); } while (readADC_F(8) > 520);  // F0 ยังเป็นพื้นขาว ให้เดินต่อ
  // motor(-1, -1);                                     // เบรกเมื่อ F0 เจอเส้นดำ
  // delay(10);
  // f_line(30, 30, 1.2f, 60, 10);


  // f_line(50, 50, 0.75f, f15, 10);
  // turn(tfr, 90, f10, 10);
  // // f_line(50, 50, 0.75f, f0, 10);
  // turn(tcl, 60, f5, 10);
  // f_line(20, 20, 0.75f, 10, 10);

  // f_line(50, 50, 1.5f, 100, 10);
  // turn(tfr, 90, f10, 10);
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//----------------------------------------------------------------
  // f_line(20, 20, 0.3f, f0 & 15, 20);
  // delay(100);
  // exitBlackLineStraight(8);
  // gyro_reset();delay(200);
  // gyro_turn(50, -1, 90.0f, 0.75f, 0.05f, 10);
  // fgyro(90.0f, 50, 1.0f, 18.0f, 10);
  // gyro_turn(-50, 50, 0.0f, 0.75f, 0.05f, 10);
  // down_a();
  // fgyro(0.0f, 40, 1.0f, 25.0f, 10);
  // bgyro(0.0f, 40, 1.0f, 28.0f, 10);
  // gyro_turn(50, -50, 90.0f, 0.75f, 0.05f, 10);
  // bgyro(90.0f, 50, 1.0f, 25.0f, 10);
  // gyro_turn(50, -50, 180.0f, 0.75f, 0.05f, 10);
  //-----------------------------------------------------------------
  //ข้ามตัว Z
  // f_line(30, 30, 1.0f, f15, 20);delay(100);
  // gyro_reset();delay(200);
  // // rotateFW_pivot(40, -40.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // rotateFW_pivot(40, 105.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // rotateFW_pivot(40, 10.0f, 20);   // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // f_line(70, 70, 1.0f, 45, 0);


  //ข้ามตัว S
  // f_line(40, 40, 1.0f, f0, 10);
  // turn(tfl, 100, f5, 1);
  // f_line(30, 30, 0.95f, 50, 0);

  //-----------------------------คี้บปลาย S
  // arm_down_open();
  // f_line(40, 40, 1.0f, f0, 10);
  // turn(tfl, 80, f5, 1);
  // f_line(30, 30, 0.75f, f15, 20);
  // gyro_reset();delay(200);
  // gyro_turn(50, -1, 85.0f, 0.75f, 0.05f, 10);
  // fgyro(85.0f, 20, 1.0f, 8.0f, 10);
  // delay(200);
  // arm_kib();
  // delay(200);
  // b_line(30, 30, 0.0f, 4, 10);
  // turn(tr, 50, f10, 10);
  // f_line(30, 30, 0.75f, 30, 10);
  //-----------------------------คี้บปลาย S

  // // คี้บปลาย Z
  // arm_up_close();
  // f_line(40, 40, 1.0f, f15, 10);
  // turn(tcr, 50, f10, 10);
  // arm_u_lr();
  // delay(250);
  // f_line(20, 20, 0.75f, 5, 10);
  // delay(150);
  // gyro_reset();delay(200);
  // gyro_turn(-1, 30, -65.0f, 0.75f, 0.05f, 20);
  // delay(200);
  // arm_kib();
  // delay(200);
  // gyro_turn(1, -30, 0.0f, 0.75f, 0.05f, 20);
  // b_line(20, 20, 0.5f, 5, 1);
  // f_line(20, 20, 0.5f, f0, 10);
  // turn(tfl, 100, f5, 10);
  // f_line(60, 60, 1.0f, 30, 0);
  // turn(tcl, 50, f5, 10);
  // // คี้บปลาย Z
  //-----------------------------------------------------------------


  //////////////////////////////////-----------------------------//////////////////////
  // f_line(20, 20, 0.3f, f0 & 15, 20);
  // delay(100);
  // exitBlackLineStraight(8);
  // // delay(200);
  // gyro_reset();delay(200);
  // // delay(200);
  // // fw_gyro(70.0f, 40, 1.2f, 10.0f, 0);
  // rotateFW_pivot(40, -10.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // delay(100);

  // fw_gyro(-10.0f, 50, 1.2f, 10.0f, 0);
  // f_line(55, 50, 0.0f, cr, 10);
  // // 
  // // f_line(50, 50, 0.0f, 3, 10);
  // turn(tl, 40, f10, 10);
  // positoin_error = 10;
  // f_line(60, 60, 0.72f, gyro_angle(120.0f), 10);
  // delay(100);
  // rotateFW_pivot(50, 235.0f, 20);  // หมุนด้วยล้อเดินหน้าไปหัว +90°; เบรกสวน 10 ms
  // arm_closeUp();
  // fw_gyro(235.0f, 20, 1.0f, 10.0f, 10);
  // // bw_gyro(-255.0f, 40, 1.0f, 5.0f, 0);
  // b_line(40, 40, 0.0f, b15, 0);
  // turn(tcr, 60, f11, 10);
  // arm_kib();
  // positoin_error = 90;
  // f_line(60, 60, 0.72f, gyro_angle(165.0f), 0);
  // ////////----------------------------------------
  // fw_gyro(-180.0f, 40, 1.2f, 15.0f, 10);

  // 
  // f_line(40, 40, 0.0f, f0, 0);
  // f_line(40, 40, 0.0f, 7, 20);
  // do { motor(-1, 50); } while (readADC_F(15) > 520);  // F0 ยังเป็นพื้นขาว ให้เดินต่อ
  // motor(-1, -1);                                     // เบรกเมื่อ F0 เจอเส้นดำ
  // delay(10);
  // do { motor(50, -1); } while (readADC_F(8) > 520);  // F0 ยังเป็นพื้นขาว ให้เดินต่อ
  // motor(-1, -1);                                     // เบรกเมื่อ F0 เจอเส้นดำ
  // delay(10);
  // positoin_error = 50;



  //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////



// set_line_pid_tuning(0.050f);  // Kd ของ f_line/b_line; Kp ใช้ค่าที่ส่งในคำสั่ง
  // f_line(80, 80, 0.65f, 25.0f, 0);
  // f_line(50, 50, 1.5f, f15, 10);
  // turn(tfr, 90, f11, 5);
  // // f_line(45, 45, 0.7f, f0, 10);
  // turn(tfl, 90, f4, 5);
  // f_line(90, 90, 2.0f, 30, 0);
  // // wait_button();
  // f_line(65, 65, 0.65f, 35.0f, 0, crossing_mode);
  // set_line_pid_tuning(0.050f);  // Kd ของ f_line/b_line; Kp ใช้ค่าที่ส่งในคำสั่ง
  // // f_line(70, 70, 2.0f, f15, 0);
  // // f_line(70, 70, 2.0f, 20, 0);
  // f_line(100, 100, 1.2f, 50, 0);
  // turn(tfr, 90, f11, 5);
  // set_line_pid_tuning(0.050f);  // Kd ของ f_line/b_line; Kp ใช้ค่าที่ส่งในคำสั่ง
  // f_line(100, 100, 1.2f, 40, 0);
  // keep_z();
  // b_line(20, 20, 0.5f, 1, 0);
  // turn(tcr, 60, f11, 20);
  // f_line(60, 60, 1.25f, 15, 0);
  // f_line(100, 100, 1.2f, 35, 0);
  // turn(tfl, 90, f4, 5);
  // set_line_pid_tuning(0.050f);  // Kd ของ f_line/b_line; Kp ใช้ค่าที่ส่งในคำสั่ง
  // f_line(100, 100, 1.2f, 35, 0);
  // f_line(50, 50, 1.0f, f0, 10);
  // turn(tfl, 90, f4, 5);
  // f_line(50, 50, 2.0f, 60, 20);
  // t_r();
  // f_line(50, 50, 2.0f, 50, 0);
  // f_line(50, 50, 0.5f, f0, 10);
  // turn(tfl, 90, f4, 5);
  // f_line(90, 90, 2.0f, 40, 0);
  // f_line(45, 45, 1.5f, f15, 10);
  // turn(tfr, 90, f11, 5);
  // turn(tfl, 90, f4, 5);
  // f_line(80, 80, 2.0f, 25, 40);

  //   set_line_pid_tuning(0.050f);  // Kd ของ f_line/b_line; Kp ใช้ค่าที่ส่งในคำสั่ง
  // f_line(100, 100, 2.0f, 80, 0);
  // set_line_pid_tuning(0.010f);  // Kd ของ f_line/b_line; Kp ใช้ค่าที่ส่งในคำสั่ง
  // f_line(40, 40, 0.75f, f0, 10);
  // set_line_pid_tuning(0.050f);  // Kd ของ f_line/b_line; Kp ใช้ค่าที่ส่งในคำสั่ง
  // turn(tfl, 90, f4, 5);
  // // turn(tfr, 90, f11, 5);
  // f_line(60, 60, 2.0f, 30, 0);
  // f_line(40, 40, 1.5f, f15, 10);
  // turn(tfr, 90, f11, 5);
  // f_line(70, 70, 2.0f, 40, 0);
  // f_line(40, 40, 0.75f, f15, 10);
  // turn(tfr, 90, f11, 5);
  // f_line(80, 80, 2.0f, 40, 0);
  // f_line(40, 40, 1.5f, f15, 10);
  // turn(tfr, 90, f11, 5);
  // turn(tfl, 90, f4, 5);
  // f_line(80, 80, 2.0f, 20, 30);